Repository: mohammedJ-Sadiq/StudentActivity
Catalog: Resources/Language.*.resx
Languages: ar

source: About
ar: عن الموقع

# About page
source: Your application description page.
ar: صفحة وصف البرنامج

source: About Student's Activities
ar: عن الأنشطة الطلابية

source: Add New Club
ar: اضافة نادي جديد

source: Add New Program
ar: اضافة برنامج جديد

source: Add Student
ar: اضافة طالب

# Added student already registerd in program
source: The student you are trying to register a program for him is already registered in that program.
ar: الطالب الذي تحاول اضافته للبرنامج مسجل في البرنامج مسبقا

# AdminHome
source: Admin Home Page
ar: صفحة المسؤول الرئيسية

# AdminHome_can_do_1
source: You can create and manage all programs
ar: تستطيع انشاء وادارة جميع البرامج

# AdminHome_can_do_2
source: You can see the student list for a program
ar: تستطيع رؤية قائمة الطلابين المسجلين في برنامج

# AdminHome_can_do_3
source: You can manage the eligiblity of students
ar: تستطيع ادارة الطلاب المستحقين لشهادة برنامج

# AdminHome_can_do_4
source: You can Manage create and manage the clubs
ar: تستطيع انشاء نادي جديد او التعديل على نادي مسجل

# AdminHome_can_do_5
source: You can approve or reject any requested program from club coordinator
ar: تستطيع الموافقة او الرفض على البرامج المطلوبة من قبل رؤساء الأندية

# Already a member of the club
source: The Club you are trying to join, you are already member of it!
ar: النادي الذي تحاول الانضمام اليه انت عضوا فيه مسبقا!

source: Approve
ar: موافقة

# Approve program confirmation
source: Are you sure you want to approve this program?
ar: هل أنت متأكد من أنك تريد الموافقة على هذا البرنامج؟

source: Approved
ar: مقبول

source: Available Programs
ar: البرامج المتاحة

source: Cancel
ar: الغاء

source: Certified
ar: التوثيق

# CertifiedIntro
source: We offer an easy way for students who completed any program to print their Certification for these programs whenever and from wherever they want..
ar: نقدم طريقة سهلة للطلاب الذين أكملوا أحد البرامج لطباعة الشهادة الخاصة بهذه البرامج من أي مكان وفي اي وقت.

# Choose a program to register
source: Choose a program to register in
ar: اختر برنامج للتسجيل:

# Club already Exist
source: The Club you are trying to add is already Exist!
ar: النادي الذي تحاول اضافته موجود مسبقا!

source: Club Name
ar: اسم النادي

source: Club Vision in Arabic
ar: رؤية النادي باللغة العربية

source: Club Vision in English
ar: رؤية النادي باللغة الإنجليزية

source: Club Coordinator
ar: رئيس النادي

# ClubCorHome
source: Club Coordinator Home Page
ar: صفحة رئيس النادي الرئيسية

# ClubCorHome_can_do_1
source: You can Request programs that can be approved later by the admin
ar: تستطيع تقديم طلب إقامة برنامج لمسؤول الأنشطة الطلابية

# ClubId
source: Club
ar: النادي

source: Clubs
ar: الأندية

source: Completed Programs
ar: البرامج المكتملة

source: ConfirmPassword
ar: تأكيد كلمة المرور

source: Connectivity
ar: الاتصال

source: Contact
ar: معلومات الاتصال

# Contact page
source: Your contact page.
ar: صفحة التواصل

source: Coordinator
ar: رئيس النادي

source: Create a new account.
ar: انشاء حساب جديد

# CurrentProgramsList
source: Here is a List of the Current Provided Programs:
ar: قائمة البرامج المتاحة:

source: Delete
ar: حذف

source: Delete field
ar: حذف الحقل

source: Delete Program
ar: حذف البرنامج

# Delete Program Confirmation
source: Are you sure you want to delete this Program ?
ar: هل أنت متأكد من أنك تريد حذف هذا البرنامج؟

# DeleteClubConfirmation
source: Are you sure you want to delete this Club?
ar: هل أنت متأكد من أنك تريد حذف هذا النادي؟

# DeleteConfirmation
source: Are you sure you want to delete this field ?
ar: هل أنت متاكد من أنك تريد حذف هذا الحقل؟

source: Description
ar: الوصف

source: Details
ar: تفاصيل

# DeveloperAhmed
source: Ahmed, Developer
ar: أحمد, مطور

# DeveloperSomeone
source: Someone, Developer
ar: شخص ما, مطور

# DevelopingLeaderMohammed
source: Mohammed, Developing leader
ar: محمد, قائد فريق المطورين

source: Edit
ar: تعديل

source: Edit Program
ar: تعديل برنامج

source: Email
ar: البريد الالكتروني

source: End Date
ar: تاريخ النهاية

source: Enter Student Name:
ar: :ادخل اسم الطالب

source: Enter the date of the program:
ar: :ادخل تاريخ البرنامج

source: Enter the lecturer name:
ar: :ادخل اسم المقدم

source: Enter the title of the program:
ar: :ادخل اسم البرنامج

# Error occured
source: An error has occurred.
ar: حدث خطأ!

# External login removed
source: The external login was removed.
ar: تمت ازالة تسجيل الدخول الخارجي

source: Finished Programs
ar: البرامج المنتهية

source: Hard Work
ar: العمل الجاد

# HardWorkIntro
source: Putting more effort on developing our services to serve students in an easy way..
ar: بذل الجهد الكثير لتطوير الخدمات المقدمة من اجل خدمة الطلاب

source: Hello
ar: مرحبا بك!

source: Home
ar: الرئيسية

source: Invalid code.
ar: الرمز خاطئ

# Invalid login
source: Invalid login attempt.
ar: فشلت محاولة تسجيل الدخول

source: Is Eligible
ar: مستحق؟

# Join Club
source: Join a Club
ar: الانضمام لنادي

# JUC Activities Website
source: Jubail University College Activities Website
ar: موقع الأنشطة الطلابية لكلية الجبيل الجامعية

# JUC intro
source: This Website is going to allow the student to register for programs, and print them later on.
ar: هذا الموقع يتيح للطلاب التسجيل في البرامج, وطباعة شهادات هذه البرامج

source: JUCGate
ar: بوابة كلية الجبيل الجامعية

# JUCGateBody
source: The Main Gate of JUC
ar: البوابة الرئيسية للجامعة

source: Leave Club
ar: الخروج من النادي

# leave this club
source: Are you sure you want to leave this club
ar: هل أنت متاكد من أنك تريد مغادرة هذا النادي؟

# local account to log in
source: Use a local account to log in.
ar: استخدم حساب داخلي لتسجيل الدخول

source: Login
ar: تسجيل الدخول

source: Log Off
ar: تسجيل الخروج

source: LogIn
ar: دخول

source: Love
ar: الحب

# LoveIntro
source: Trying our best to provide whatever students want depending on their wishes..
ar: العمل بكل جهد لتوفير ما يريده الطلاب بناءا على رغباتهم

source: Maximum Student Number
ar: عدد الطلاب الأقصى

source: MISSION
ar: المهمة

# MISSIONBody
source: Our mission is to make Student's life easier and funnier.
ar: مهمتنا تتمحور حول جعل حياة الطالب أسهل وأكثر مرحا..

source: Mobile No.
ar: رقم الجوال

source: Mobility
ar: التنقل

source: Name
ar: الاسم

source: New Request
ar: طلب جديد

source: Next
ar: التالي

# No available programs
source: There are no available programs
ar: لا توجد برامج متاحة

# No pending programs
source: There are no pending programs
ar: لا توجد برامج قيد الانتظار

# No programs registered
source: There are no programs registered yet!
ar: !لا توجد برامج مسجلة لديك

# No student registered
source: There are no students registered in this program
ar: لا توجد برامج مسجلة للطالب

# NoCompletedPrograms
source: You have not completed any programs yet!
ar: لم تكمل أي برنامج الى الآن!

source: Our Values
ar: قيمنا

source: Password
ar: كلمة المرور

# Password has been changed
source: Your password has been changed.
ar: تم تغيير كلمة المرور بنجاح

# Password has been set
source: Your password has been set.
ar: تم وضع كلمة المرور

# Password Register
source: Password: (Requires one Capital letter, one small letter, one special character and numbers)
ar: كلمة المرور:(يجب أن تحتوي على حرف كبير, حرف صغير, رمز خاص و أرقام)

source: Pending
ar: قيد الانتظار

source: Pending Programs
ar: البرامج قيد الانتظار

source: Pending Status
ar: حالة الطلب

# Phone number added
source: Your phone number was added.
ar: تمت اضافة رقم الجوال

# Phone number removed
source: Your phone number was removed.
ar: تمت ازالة رقم الجوال

source: Portfolio
ar: الملف التعريفي

source: Previous
ar: السابق

source: Print Certificate
ar: طباعة شهادة

# Program already added
source: The program you are trying to add is already added
ar: البرنامج الذي تحاول اضافته مضاف مسبقا

# ProgramBody
source: A program in the MPH
ar: اقامة برنامج في قاعة الاغراض المتعددة

source: Program Details
ar: تفاصيل البرنامج

source: Program Form
ar: نموذج برنامج

source: Program Name
ar: اسم البرنامج

source: Programs
ar: البرامج

# ProgramsOfferedIntro
source: We provide different kinds of programs such as courses, out-side visits, and activities..
ar: نحن نوفر العديد من البرامج كالدورات, الزيارات الخارجية والأنشطة.

source: Register
ar: تسجيل جديد

source: Register as a new user
ar: تسجيل مستخدم جديد

source: Registered Programs
ar: البرامج المسجلة

source: Register in Program
ar: التسجيل في البرنامج

source: Reject
ar: رفض

# Reject program confirmation
source: Are you sure you want to reject this program?
ar: هل أنت متأكد من أنك تريد رفض هذا البرنامج؟

source: Rejected
ar: مرفوض

source: Remember Me
ar: تذكرني!

source: Remove Status
ar: إزالة الحالة

# Request Programs
source: Request Program
ar: طلب برنامج

source: Requested Programs
ar: البرامج المطلوبة

source: Retrieve a program
ar: استعادة برنامج

# Retrieve program already available
source: The program you are trying to retrieve is already avaliable
ar: البرنامج الذي تحاول استعادته موجود مسبقا

# Retrieve program not exist
source: The program you are trying to retrieve does not exist
ar: البرنامج الذي تحاول استعادته غير موجود

source: Save
ar: حفظ

source: Select a Club
ar: اختر نادي

source: Select a Program
ar: اختر برنامج

source: Services
ar: الخدمات

# Slider1
source: "This Website is Made for JUC Students By JUC Students. We Are so happy with this result!"
ar: "هذا الموقع تم انشاؤه لطلاب كلية الجبيل الجماعية من قبل طلاب الكلية... نحن نفتخر بهذه النتيجة!"

# Slider2
source: "One word... WOW!!"
ar: "كلمة واحدة... رائع جدا!!"

# Slider3
source: "Could I... BE any more happy with this Achievement?"
ar: "وهل أكون... أسعد بشيء غير هذا الانجاز؟"

source: Start Date
ar: تاريخ البداية

# Student already registered in program
source: You are already registered in this program
ar: انت مسجل مسبقا في هذا البرنامج

source: Student Id
ar: السجل الأكاديمي للطالب

source: Student Name
ar: اسم الطالب

# Student not registerd in website
source: The student has not registered in the website yet!
ar: الطالب غير مسجل في الموقع

source: Student's Activity
ar: الأنشطة الطلابية

# StudentActivityShortIntro
source: The Best Way To Make Student's Life More Interesting!!
ar: الطريق الأفضل لجعل حياة الطالب أكثر مرحاُ!!

source: Student Home
ar: صفحة الطالب الرئيسية

# StudentHome_can_do_1
source: You can register in any available program
ar: تستطيع التسجيل في أي برنامج من البرامج المتاحة

# StudentHome_can_do_2
source: You can view all registered programs
ar: تستطيع عرض جميع البرامج المسجل بها

# StudentHome_can_do_3
source: You can join a club
ar: تستطيع التسجيل في نادي

# StudentHome_can_do_4
source: You can print a certificate for any completed program
ar: تستطيع طباعة شهادة الدورات التي أتممتها

source: Students List
ar: قائمة الطلاب

source: Submit
ar: ارسل

source: Time
ar: الوقت

source: Title
ar: العنوان

# Two-factor authentication provider has been set
source: Your two-factor authentication provider has been set.
ar: تم وضع المصادقة الثنائية

# Verify phone failed
source: Failed to verify phone
ar: فشل التحقق من رقم الجوال

source: VISION
ar: الرؤية

source: Visit
ar: زيارة

# VisitBody
source: A Site Visit done by Civil Club
ar: زيارة لموقع عمل لنادي الهندسة المدنية

# Water Mark Certificate
source: Water Mark a Certificate
ar: انشاء شهادة

source: WhatWeOffer
ar: ماذا نقدم!
